In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.read_csv("pokemon.csv")

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [3]:
pd.read_csv('pokemon.csv' , index_col = 'Pokemon')

                       Type
Pokemon
Bulbasaur    Grass / Poison
Ivysaur      Grass / Poison
Venusaur     Grass / Poison
Charmander             Fire
Charmeleon             Fire
...                     ...
Stakataka      Rock / Steel
Blacephalon    Fire / Ghost
Zeraora            Electric
Meltan                Steel
Melmetal              Steel

[809 rows x 1 columns]

In [4]:
pd.read_csv('pokemon.csv' , index_col = 'Pokemon').squeeze()   # Displays as Series

Pokemon
Bulbasaur      Grass / Poison
Ivysaur        Grass / Poison
Venusaur       Grass / Poison
Charmander               Fire
Charmeleon               Fire
                    ...
Stakataka        Rock / Steel
Blacephalon      Fire / Ghost
Zeraora              Electric
Meltan                  Steel
Melmetal                Steel
Name: Type, Length: 809, dtype: object

## SQUEZE() ------> Used to convert DataFrame To Series

In [5]:
pokemon = pd.read_csv('pokemon.csv' , index_col = 'Pokemon').squeeze()

In [6]:
type(pd.read_csv('pokemon.csv' , index_col = 'Pokemon').squeeze())   # Displays as Series

pandas.core.series.Series

In [7]:
pd.read_csv("google_stocks.csv")

            Date    Close
0     2004-08-19    49.98
1     2004-08-20    53.95
2     2004-08-23    54.50
3     2004-08-24    52.24
4     2004-08-25    52.80
...          ...      ...
3819  2019-10-21  1246.15
3820  2019-10-22  1242.80
3821  2019-10-23  1259.13
3822  2019-10-24  1260.99
3823  2019-10-25  1265.13

[3824 rows x 2 columns]

In [8]:
pd.read_csv("google_stocks.csv").head()

         Date  Close
0  2004-08-19  49.98
1  2004-08-20  53.95
2  2004-08-23  54.50
3  2004-08-24  52.24
4  2004-08-25  52.80

In [9]:
pd.read_csv("google_stocks.csv").dtypes

Date      object
Close    float64
dtype: object

In [10]:
pd.read_csv("google_stocks.csv", parse_dates = ["Date"]).dtypes         # Parsing Date column As DATE

Date     datetime64[ns]
Close           float64
dtype: object

In [11]:
pd.read_csv("google_stocks.csv", parse_dates = ["Date"]).head()

        Date  Close
0 2004-08-19  49.98
1 2004-08-20  53.95
2 2004-08-23  54.50
3 2004-08-24  52.24
4 2004-08-25  52.80

In [12]:
google = pd.read_csv(
    "google_stocks.csv",
    parse_dates = ["Date"],
    index_col = "Date",
)
                                    
print(type(google))

<class 'pandas.core.frame.DataFrame'>

In [13]:
google = pd.read_csv(
    "google_stocks.csv",
    parse_dates = ["Date"],
    index_col = "Date",
).squeeze()

print(type(google))

<class 'pandas.core.series.Series'>

In [14]:
google = pd.read_csv(
    "google_stocks.csv",
    parse_dates = ["Date"],
    index_col = "Date",
)                                               # Here date is INDEXED , so it c\wont show dtype as date

print(google.dtypes)

Close    float64
dtype: object

In [15]:
pd.read_csv("revolutionary_war.csv")

                                Battle  Start Date          State
0                         Powder Alarm    9/1/1774  Massachusetts
1    Storming of Fort William and Mary  12/14/1774  New Hampshire
2     Battles of Lexington and Concord   4/19/1775  Massachusetts
3                      Siege of Boston   4/19/1775  Massachusetts
4                   Gunpowder Incident   4/20/1775       Virginia
..                                 ...         ...            ...
227                Siege of Fort Henry   9/11/1782       Virginia
228         Grand Assault on Gibraltar   9/13/1782            NaN
229          Action of 18 October 1782  10/18/1782            NaN
230          Action of 6 December 1782   12/6/1782            NaN
231          Action of 22 January 1783   1/22/1783       Virginia

[232 rows x 3 columns]

In [16]:
pd.read_csv("revolutionary_war.csv").tail()

                         Battle  Start Date     State
227         Siege of Fort Henry   9/11/1782  Virginia
228  Grand Assault on Gibraltar   9/13/1782       NaN
229   Action of 18 October 1782  10/18/1782       NaN
230   Action of 6 December 1782   12/6/1782       NaN
231   Action of 22 January 1783   1/22/1783  Virginia

In [17]:
pd.read_csv(
    "revolutionary_war.csv",
    parse_dates = ["Start Date"]).dtypes

Battle                object
Start Date    datetime64[ns]
State                 object
dtype: object

In [18]:
pd.read_csv(
    "revolutionary_war.csv",
    index_col = "Start Date",
    parse_dates = ["Start Date"],
).tail()

                                Battle     State
Start Date
1782-09-11         Siege of Fort Henry  Virginia
1782-09-13  Grand Assault on Gibraltar       NaN
1782-10-18   Action of 18 October 1782       NaN
1782-12-06   Action of 6 December 1782       NaN
1783-01-22   Action of 22 January 1783  Virginia

In [19]:
pd.read_csv(
    "revolutionary_war.csv",
    index_col = "Start Date",
    parse_dates = ["Start Date"],
).dtypes

Battle    object
State     object
dtype: object

In [20]:
pd.read_csv(
    "revolutionary_war.csv",
    index_col = "Start Date",
    parse_dates = ["Start Date"],
    usecols = ["State", "Start Date"],      # USING ONLY 2 COLUMNS
).tail()

               State
Start Date
1782-09-11  Virginia
1782-09-13       NaN
1782-10-18       NaN
1782-12-06       NaN
1783-01-22  Virginia

In [21]:
wars = pd.read_csv(
        "revolutionary_war.csv",
        index_col = "Start Date",
        parse_dates = ["Start Date"],
        usecols = ["State", "Start Date"],      # USING ONLY 2 COLUMNS
    ).squeeze()

type(wars)

pandas.core.series.Series

In [22]:
wars

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
                  ...
1782-09-11         Virginia
1782-09-13              NaN
1782-10-18              NaN
1782-12-06              NaN
1783-01-22         Virginia
Name: State, Length: 232, dtype: object

## Sorting a Series

#### 1.Sorting by Values with the sort_values Method

In [23]:
wars = pd.read_csv(
        "revolutionary_war.csv",
        index_col = "Start Date",
        parse_dates = ["Start Date"],
        usecols = ["State", "Start Date"],      
        
    ).squeeze()

In [24]:
wars.sort_values()

Start Date
1781-09-06    Connecticut
1779-07-05    Connecticut
1777-04-27    Connecticut
1777-09-03       Delaware
1777-05-17        Florida
                 ...
1782-08-08            NaN
1782-08-25            NaN
1782-09-13            NaN
1782-10-18            NaN
1782-12-06            NaN
Name: State, Length: 232, dtype: object

In [25]:
wars.sort_values(ascending = False)

Start Date
1783-01-22    Virginia
1781-09-28    Virginia
1779-05-10    Virginia
1781-09-05    Virginia
1781-07-06    Virginia
                ...
1782-08-08         NaN
1782-08-25         NaN
1782-09-13         NaN
1782-10-18         NaN
1782-12-06         NaN
Name: State, Length: 232, dtype: object

#### 2.Sorting by Index with the sort_index Method

In [26]:
pokemon.sort_index()  # BASED ON INDEX

Pokemon
Abomasnow        Grass / Ice
Abra                 Psychic
Absol                   Dark
Accelgor                 Bug
Aegislash      Steel / Ghost
                  ...
Zoroark                 Dark
Zorua                   Dark
Zubat        Poison / Flying
Zweilous       Dark / Dragon
Zygarde      Dragon / Ground
Name: Type, Length: 809, dtype: object

In [27]:
pokemon.sort_values()   # BASED ON VALUES

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

#### 3.Higest and Lowest Stocks

In [28]:
google = pd.read_csv(
    "google_stocks.csv",
    parse_dates = ["Date"],
    index_col = "Date",
).squeeze()

In [29]:
google.nlargest()

Date
2019-04-29    1287.58
2019-04-26    1272.18
2018-07-26    1268.33
2019-10-25    1265.13
2019-04-23    1264.55
Name: Close, dtype: float64

In [30]:
google.nsmallest()

Date
2004-09-03    49.82
2004-09-01    49.94
2004-08-19    49.98
2004-09-02    50.57
2004-09-07    50.60
Name: Close, dtype: float64

### 4.Overwriting a Series with the inplace Parameter

#### NOTE

- inplace=False (default) → returns a new object, original unchanged.

- inplace=True → modifies the original object directly, no new copy is returned.

In [31]:
pokemon.sort_values()

Pokemon
Illumise                Bug
Silcoon                 Bug
Pinsir                  Bug
Burmy                   Bug
Wurmple                 Bug
                  ...
Tirtouga       Water / Rock
Relicanth      Water / Rock
Corsola        Water / Rock
Carracosta     Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [32]:
pd.read_csv("pokemon.csv")

         Pokemon            Type
0      Bulbasaur  Grass / Poison
1        Ivysaur  Grass / Poison
2       Venusaur  Grass / Poison
3     Charmander            Fire
4     Charmeleon            Fire
..           ...             ...
804    Stakataka    Rock / Steel
805  Blacephalon    Fire / Ghost
806      Zeraora        Electric
807       Meltan           Steel
808     Melmetal           Steel

[809 rows x 2 columns]

In [33]:
pokemon = pokemon.sort_values()
pokemon.sort_values(inplace=True)
print()

### Counting Values with the value_counts Method

In [34]:
pokemon.value_counts()

Type
Normal              65
Water               61
Grass               38
Psychic             35
Fire                30
                    ..
Rock / Poison        1
Steel / Ground       1
Steel / Fighting     1
Steel / Dragon       1
Water / Steel        1
Name: count, Length: 159, dtype: int64

In [35]:
pokemon.value_counts(normalize = True)*100    # FREQUENCY DISTRIBUTION 

# IT IS COSIDERING SORTED POKEMON COZ WE SORTED AND INPLACED

Type
Normal              8.034611
Water               7.540173
Grass               4.697157
Psychic             4.326329
Fire                3.708282
                      ...
Rock / Poison       0.123609
Steel / Ground      0.123609
Steel / Fighting    0.123609
Steel / Dragon      0.123609
Water / Steel       0.123609
Name: proportion, Length: 159, dtype: float64

In [36]:
pokemon

# IT IS COSIDERING SORTED POKEMON COZ WE SORTED AND INPLACED

Pokemon
Illumise                Bug
Cascoon                 Bug
Caterpie                Bug
Karrablast              Bug
Pineco                  Bug
                  ...
Corsola        Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
Relicanth      Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

In [37]:
pokemon.value_counts(normalize = True).round(2)*100

Type
Normal              8.0
Water               8.0
Grass               5.0
Psychic             4.0
Fire                4.0
                   ...
Rock / Poison       0.0
Steel / Ground      0.0
Steel / Fighting    0.0
Steel / Dragon      0.0
Water / Steel       0.0
Name: proportion, Length: 159, dtype: float64

In [38]:
google

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

### 5.Sorting in Particulat Bins ( RANGES of stock prices )

In [39]:
google.value_counts(bins=[0,200,400,600,800,1000,1200,1400])

(200.0, 400.0]      1568
(-0.001, 200.0]      595
(400.0, 600.0]       575
(1000.0, 1200.0]     406
(600.0, 800.0]       380
(800.0, 1000.0]      207
(1200.0, 1400.0]      93
Name: count, dtype: int64

In [40]:
buckets = [0, 100, 200, 300, 400, 500 , 600 , 700 , 800 , 900 ,  1000, 1100 ,  1200, 1300 , 1400]

google.value_counts(bins=buckets)

(200.0, 300.0]      1143
(100.0, 200.0]       431
(300.0, 400.0]       425
(500.0, 600.0]       423
(700.0, 800.0]       269
(1100.0, 1200.0]     207
(1000.0, 1100.0]     199
(-0.001, 100.0]      164
(400.0, 500.0]       152
(900.0, 1000.0]      129
(600.0, 700.0]       111
(1200.0, 1300.0]      93
(800.0, 900.0]        78
(1300.0, 1400.0]       0
Name: count, dtype: int64

In [41]:
wars.head()

Start Date
1774-09-01    Massachusetts
1774-12-14    New Hampshire
1775-04-19    Massachusetts
1775-04-19    Massachusetts
1775-04-20         Virginia
Name: State, dtype: object

In [42]:
# DataFrame.value_counts() → counts unique rows.

# dropna = False → include NaN in counting.

# VAlue_count --> counting repetitions

In [43]:
wars.value_counts(dropna = False).head()

State
NaN               70
South Carolina    31
New York          28
New Jersey        24
Virginia          21
Name: count, dtype: int64

In [44]:
wars.index.value_counts()   # COUNTING BY TAKING  INDEX ----> DATE

Start Date
1775-04-19    2
1778-09-07    2
1777-08-22    2
1781-04-25    2
1781-09-13    2
             ..
1782-09-11    1
1782-09-13    1
1782-10-18    1
1782-12-06    1
1783-01-22    1
Name: count, Length: 217, dtype: int64

In [45]:
wars.index.value_counts(dropna = False).head()

Start Date
NaT           4
1775-04-19    2
1777-08-22    2
1778-09-07    2
1781-04-25    2
Name: count, dtype: int64

In [46]:
func = [len , min , max]

for f in func:
    print(f(google))

3824
49.82
1287.58

### Invoking a Function on Every Series Value with the apply Method

- used to create Funtions and Apply on Series

In [47]:
round(99.4)

99

In [48]:
google

Date
2004-08-19      49.98
2004-08-20      53.95
2004-08-23      54.50
2004-08-24      52.24
2004-08-25      52.80
               ...
2019-10-21    1246.15
2019-10-22    1242.80
2019-10-23    1259.13
2019-10-24    1260.99
2019-10-25    1265.13
Name: Close, Length: 3824, dtype: float64

In [49]:
google.apply(round)

Date
2004-08-19      50
2004-08-20      54
2004-08-23      54
2004-08-24      52
2004-08-25      53
              ...
2019-10-21    1246
2019-10-22    1243
2019-10-23    1259
2019-10-24    1261
2019-10-25    1265
Name: Close, Length: 3824, dtype: int64

In [50]:
def single_or_multi(pokemon_type):
    if "/" in pokemon_type:
        return "Multi"
    
    return "Single"

pokemon.apply(single_or_multi)

Pokemon
Illumise      Single
Cascoon       Single
Caterpie      Single
Karrablast    Single
Pineco        Single
               ...
Corsola        Multi
Carracosta     Multi
Tirtouga       Multi
Relicanth      Multi
Empoleon       Multi
Name: Type, Length: 809, dtype: object

In [51]:
pokemon

Pokemon
Illumise                Bug
Cascoon                 Bug
Caterpie                Bug
Karrablast              Bug
Pineco                  Bug
                  ...
Corsola        Water / Rock
Carracosta     Water / Rock
Tirtouga       Water / Rock
Relicanth      Water / Rock
Empoleon      Water / Steel
Name: Type, Length: 809, dtype: object

### Importing datetime 

##### Used to check Day at date

In [52]:
import datetime as dt

today = dt.datetime(2025, 8, 26)

today.strftime("%A")

'Tuesday'

#### Reading File

In [53]:
pd.read_csv('revolutionary_war.csv')

                                Battle  Start Date          State
0                         Powder Alarm    9/1/1774  Massachusetts
1    Storming of Fort William and Mary  12/14/1774  New Hampshire
2     Battles of Lexington and Concord   4/19/1775  Massachusetts
3                      Siege of Boston   4/19/1775  Massachusetts
4                   Gunpowder Incident   4/20/1775       Virginia
..                                 ...         ...            ...
227                Siege of Fort Henry   9/11/1782       Virginia
228         Grand Assault on Gibraltar   9/13/1782            NaN
229          Action of 18 October 1782  10/18/1782            NaN
230          Action of 6 December 1782   12/6/1782            NaN
231          Action of 22 January 1783   1/22/1783       Virginia

[232 rows x 3 columns]

In [54]:
pd.read_csv('revolutionary_war.csv').dtypes

Battle        object
Start Date    object
State         object
dtype: object

In [55]:
days_of_war = pd.read_csv(

"revolutionary_war.csv",

usecols = ["Start Date"],

parse_dates = ["Start Date"] ).squeeze()

In [56]:
days_of_war

0     1774-09-01
1     1774-12-14
2     1775-04-19
3     1775-04-19
4     1775-04-20
         ...
227   1782-09-11
228   1782-09-13
229   1782-10-18
230   1782-12-06
231   1783-01-22
Name: Start Date, Length: 232, dtype: datetime64[ns]

In [57]:
days_of_war.value_counts(dropna=False)   # dropna used to drop Missing values , if False - it displays missimg values

Start Date
NaT           4
1775-04-19    2
1777-08-22    2
1778-09-07    2
1781-04-25    2
             ..
1782-09-11    1
1782-09-13    1
1782-10-18    1
1782-12-06    1
1783-01-22    1
Name: count, Length: 218, dtype: int64

In [58]:
import datetime as dt

In [59]:
def day_of_week(date):
    return date.strftime('%A')

days_of_war.dropna().apply(day_of_week).value_counts()     

# Removing mising values and applying function to check at what day we have more Wars

# first we have to drop missing values

Start Date
Saturday     39
Friday       39
Wednesday    32
Thursday     31
Sunday       31
Tuesday      29
Monday       27
Name: count, dtype: int64